/*
	*这题。。。我只能说我内牛满面了。。。。
	*手贱多加个while(cin>>n)居然给我WA！！！！有木有天理啊！亲！！！
	*给我个RE啥的我也大概能明白咋回事啊！！！！WA算是闹哪样啊！！！
	*测啊测啊。。。。测得我中途都跑肚拉稀了一回啊！！！
	*最后实在是测不出来了，在网上找的代码，发现人家写的跟我写的咋看咋一样捏。。。
	*于是乎。。。
	*先是把逻辑判断按照人家的都加上了括号。。。无效。。。
	*然后。。。我终于发现我比人家多了个while( cin >> n )！！！！
	*再然后。。。我把它华丽丽的删了。。。
	*再再然后。。。忘加了分号，CE了。。。
	*再再再然后。。。终于AC了！！！
	*我好意思说我卡在这地方卡了差不多能有一个小时吗！！！
	*虽然说好些年没有做ACM题，但是也不至于菜成这样吧！！！
	*唉。。。吐个槽。。。缅怀一下我逝去的青春。。。
*/

#include <iostream>

using namespace std;

const int MAXN = 101;

int main( void ){
    int n;
	cin >> n;
	int square = 0;
	int len = 0;
	int a[MAXN][MAXN];
	for( int i = 0; i < n; ++i ){
		for( int j = 0; j < n; ++j ){
			cin >> a[i][j];
		}
	}
	for( int i = 0; i < n; ++i ){
		for( int j = 0; j < n; ++j ){
			if( a[i][j] <= 50 ){
				++square;
				if( ( i == 0 ) || ( j == 0 ) || ( i == n-1 ) || ( j == n-1 ) ){//判断是否为边界
					++len;
				}else if( ( a[i+1][j] > 50)  || ( a[i-1][j] > 50 ) || ( a[i][j+1] > 50 ) || ( a[i][j-1] > 50 ) ){
					++len;
				}
			}
		}
	}
	cout << square << " " << len << endl;
    return 0;
}
